#include <locale.h>
#include <stdio.h>

int main()
{
	setlocale(LC_CTYPE, "");

    //Контрольный пример 1
    //A = 3, B = 6, C = 9
    //Калибровка успешна

     //Контрольный пример 2
    //A = 10, B = 2, C = 3
    //Калибровка успешна

    int A, B, C;
    int result;
    printf("Для успешной калибровки каждый параметр должен быть кратен трём\n");
    printf("Введите три параметра для калибровки через запятую: \n");
    scanf("%d, %d, %d", &A, &B, &C);


    result = ((A % 3 == 0) && (B % 3 == 0) && (C % 3 == 0));

    result && printf("Калибровка успешна\n");
    !result && printf("Калибровка не удалась\n");

    return 0;
}